n = 10
m = 12
f = [['w', '.', '.', '.', '.', '.', '.', '.', '.', 'w', 'w', '.'],
     ['.', 'w', 'w', 'w', '.', '.', '.', '.', '.', 'w', 'w', 'w'],
     ['.', '.', '.', '.', 'w', 'w', '.', '.', '.', 'w', 'w', '.'],
     ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'w', 'w', '.'],
     ['.', '.', '.', '.', '.', '.', '.', '.', '.', 'w', '.', '.'],
     ['.', '.', 'w', '.', '.', '.', '.', '.', '.', 'w', '.', '.'],
     ['.', 'w', '.', 'w', '.', '.', '.', '.', '.', 'w', 'w', '.'],
     ['w', '.', 'w', '.', 'w', '.', '.', '.', '.', '.', 'w', '.'],
     ['.', 'w', '.', 'w', '.', '.', '.', '.', '.', '.', 'w', '.'],
     ['.', '.', 'w', '.', '.', '.', '.', '.', '.', '.', 'w', '.']]
def dfs(x, y):
    # 今いるところを . に置き換える
    f[x][y] = "."

    # 移動する8方向をループ
    for dx in range(-1, 2):
        for dy in range(-1, 2):
            # x, y 方向それぞれに dx, dy 移動した場所を (nx, ny) とする
            nx = x + dx
            ny = y + dy

            # nx と ny が庭の範囲内かどうかと field[nx][ny] が水溜りかどうかを判定
            if 0 <= nx < n and 0 <= ny < m and f[nx][ny] == "w":
                dfs(nx, ny)


res = 0
for i in range(n):
    for j in range(m):
        if f[i][j] == "w":
            # Wが残っているならそこから dfs をはじめる
            dfs(i, j)
            res += 1
print(res)
